# QUESTIONS AND ANSWERS.
QUESTIONS_N_ANSWERS_MENU_MESSAGE = '🤖 Выберите что хотите изменить'
# ADD QUESTION AND ANSWER.
ADD_QUESTION_N_ANSWER_MENU_MESSAGE = '🤖 Введите вопрос и ответ на него, а затем нажмите кнопку - добавить'
ENTER_QUESTION_MESSAGE = '✏️ Введите вопрос.'
ENTER_ANSWER_MESSAGE = '✏️ Введите ответ.'
ERROR_ENTER_QUESTION_MESSAGE = '''
❗ Вопрос введён некорректно. 

Возможно вы забыли ввести его или превысили лимит по символам.
'''
ERROR_ENTER_ANSWER_MESSAGE = '''
❗ Ответ введён некорректно.

Возможно вы забыли ввести его или превысили лимит по символам.
'''
CONFIRM_ADD_QUESTION_N_ANSWER_MESSAGE = '''
❓ Вы действительно хотите сохранить данный вопрос-ответ: 

{} 

{}
'''
SUCCESSFUL_ADD_QUESTION_N_ANSWER_MESSAGE = '✅ Вопрос-ответ успешно добавлен.'
