# QUESTIONS AND ANSWERS.
QUESTIONS_N_ANSWERS_MENU_MESSAGE = '🤖 Выберите что хотите изменить'
ERROR_ENTER_QUESTION_MESSAGE = '''
❗ Вопрос введён некорректно. 

Возможно вы забыли ввести его или превысили лимит по символам.
'''
ERROR_ENTER_ANSWER_MESSAGE = '''
❗ Ответ введён некорректно.

Возможно вы забыли ввести его или превысили лимит по символам.
'''
# ADD QUESTION AND ANSWER.
ADD_QUESTION_N_ANSWER_MENU_MESSAGE = '🤖 Введите вопрос и ответ на него, а затем нажмите кнопку - добавить'
ENTER_QUESTION_MESSAGE = '✏️ Введите вопрос.'
ENTER_ANSWER_MESSAGE = '✏️ Введите ответ.'
CONFIRM_ADD_QUESTION_N_ANSWER_MESSAGE = '''
❓ Вы действительно хотите сохранить данный вопрос и ответ: 

{} 

{}
'''
SUCCESSFUL_ADD_QUESTION_N_ANSWER_MESSAGE = '✅ Вопрос и ответ успешно добавлены.'
# UPDATE QUESTION AND ANSWER.
UPDATE_QUESTION_N_ANSWER_MESSAGE = '🤖 Выберите вопрос, данные которого хотите изменить'
UPDATE_QUESTION_N_ANSWER_MENU_MESSAGE = '''
🤖 Введите новый вопрос или новый ответ на него, а затем нажмите кнопку - обновить
'''
ENTER_NEW_QUESTION_MESSAGE = '✏️ Введите новый вопрос.'
ENTER_NEW_ANSWER_MESSAGE = '✏️ Введите новый ответ.'
ERROR_UPDATE_QUESTION_N_ANSWER_MESSAGE = '❗ Невозможно обновить данные, так как вы ещё не внесли изменения.'
CONFIRM_UPDATE_QUESTION_N_ANSWER_MESSAGE = '❓ Вы действительно хотите обновить данные для вопроса: {}?'
SUCCESSFUL_UPDATE_QUESTION_N_ANSWER_MESSAGE = '✅ Данные успешно обновлены.'
# DELETE QUESTION AND ANSWER.
DELETE_QUESTION_N_ANSWER_MESSAGE = '🤖 Выберите вопрос, который хотите удалить'
SUCCESSFUL_DELETE_QUESTION_N_ANSWER_MESSAGE = '✅ Вопрос и ответ успешно удалены.'
CONFIRM_DELETE_QUESTION_N_ANSWER_MESSAGE = '❓ Вы действительно хотите удалить данный вопрос: {}?'
